In [294]:
cols = ['age', 'workclass', 'education',  'wage_per_hours',  'marital_status',
       'major occupation code', 'race', 'sex', 'capital_gain', 'capital_loss',
       'country','income']
target = 'income'

In [295]:

import pandas as pd
import numpy as np

data = pd.read_csv('census-income.data', header=None)

In [296]:

test = pd.read_csv('census-income.test', header=None)

In [297]:
np.unique(data.iloc[:,41:42])

array([' - 50000.', ' 50000+.'], dtype=object)

In [298]:
d=pd.concat([data.iloc[:,:1],data.iloc[:,1:2],data.iloc[:,4:5],data.iloc[:,5:6],data.iloc[:,7:8],data.iloc[:,9:10],data.iloc[:,10:11],data.iloc[:,12:13],data.iloc[:,16:17],data.iloc[:,17:18],data.iloc[:,34:35],data.iloc[:,41:42]],axis=1)

In [299]:
t1=pd.concat([test.iloc[:,:1],test.iloc[:,1:2],test.iloc[:,4:5],test.iloc[:,5:6],test.iloc[:,7:8],test.iloc[:,9:10],test.iloc[:,10:11],test.iloc[:,12:13],test.iloc[:,16:17],test.iloc[:,17:18],test.iloc[:,34:35],test.iloc[:,41:42]],axis=1)

In [300]:
d

,0,1,4,5,7,9,10,12,16,17,34,41
0,73,Not in universe,High school graduate,0,Widowed,Not in universe,White,Female,0,0,United-States,- 50000.
1,58,Self-employed-not incorporated,Some college but no degree,0,Divorced,Precision production craft & repair,White,Male,0,0,United-States,- 50000.
2,18,Not in universe,10th grade,0,Never married,Not in universe,Asian or Pacific Islander,Female,0,0,Vietnam,- 50000.
3,9,Not in universe,Children,0,Never married,Not in universe,White,Female,0,0,United-States,- 50000.
4,10,Not in universe,Children,0,Never married,Not in universe,White,Female,0,0,United-States,- 50000.
...,...,...,...,...,...,...,...,...,...,...,...,...
199518,87,Not in universe,7th and 8th grade,0,Married-civilian spouse present,Not in universe,White,Male,0,0,United-States,- 50000.
199519,65,Self-employed-incorporated,11th grade,0,Married-civilian spouse present,Executive admin and managerial,White,Male,6418,0,United-States,- 50000.
199520,47,Not in universe,Some college but no degree,0,Married-civilian spouse present,Not in universe,White,Male,0,0,Germany,- 50000.
199521,16,Not in universe,10th grade,0,Never married,Not in universe,White,Female,0,0,United-States,- 50000.
199522,32,Private,High school graduate,0,Never married,Other service,Black,Female,0,0,?,- 50000.

In [301]:
d.columns

Int64Index([0, 1, 4, 5, 7, 9, 10, 12, 16, 17, 34, 41], dtype='int64')

In [302]:
d.columns=cols

In [303]:
t1.columns=cols

In [304]:
t1.head()

,age,workclass,education,wage_per_hours,marital_status,major occupation code,race,sex,capital_gain,capital_loss,country,income
0,38,Private,1st 2nd 3rd or 4th grade,0,Married-civilian spouse present,Machine operators assmblrs & inspctrs,White,Female,0,0,Mexico,- 50000.
1,44,Self-employed-not incorporated,Associates degree-occup /vocational,0,Married-civilian spouse present,Professional specialty,White,Female,0,0,United-States,- 50000.
2,2,Not in universe,Children,0,Never married,Not in universe,White,Male,0,0,United-States,- 50000.
3,35,Private,High school graduate,0,Divorced,Executive admin and managerial,White,Female,0,0,United-States,- 50000.
4,49,Private,High school graduate,0,Divorced,Precision production craft & repair,White,Male,0,0,United-States,- 50000.

In [305]:
d.head()

,age,workclass,education,wage_per_hours,marital_status,major occupation code,race,sex,capital_gain,capital_loss,country,income
0,73,Not in universe,High school graduate,0,Widowed,Not in universe,White,Female,0,0,United-States,- 50000.
1,58,Self-employed-not incorporated,Some college but no degree,0,Divorced,Precision production craft & repair,White,Male,0,0,United-States,- 50000.
2,18,Not in universe,10th grade,0,Never married,Not in universe,Asian or Pacific Islander,Female,0,0,Vietnam,- 50000.
3,9,Not in universe,Children,0,Never married,Not in universe,White,Female,0,0,United-States,- 50000.
4,10,Not in universe,Children,0,Never married,Not in universe,White,Female,0,0,United-States,- 50000.

In [306]:
t1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99762 entries, 0 to 99761
Data columns (total 12 columns):
age                      99762 non-null int64
workclass                99762 non-null object
education                99762 non-null object
wage_per_hours           99762 non-null int64
marital_status           99762 non-null object
major occupation code    99762 non-null object
race                     99762 non-null object
sex                      99762 non-null object
capital_gain             99762 non-null int64
capital_loss             99762 non-null int64
country                  99762 non-null object
income                   99762 non-null object
dtypes: int64(4), object(8)
memory usage: 9.1+ MB

In [307]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 199523 entries, 0 to 199522
Data columns (total 12 columns):
age                      199523 non-null int64
workclass                199523 non-null object
education                199523 non-null object
wage_per_hours           199523 non-null int64
marital_status           199523 non-null object
major occupation code    199523 non-null object
race                     199523 non-null object
sex                      199523 non-null object
capital_gain             199523 non-null int64
capital_loss             199523 non-null int64
country                  199523 non-null object
income                   199523 non-null object
dtypes: int64(4), object(8)
memory usage: 18.3+ MB

In [308]:
d[d.duplicated()].count()

age                      120288
workclass                120288
education                120288
wage_per_hours           120288
marital_status           120288
major occupation code    120288
race                     120288
sex                      120288
capital_gain             120288
capital_loss             120288
country                  120288
income                   120288
dtype: int64

In [309]:
t1[t1.duplicated()].count()

age                      54013
workclass                54013
education                54013
wage_per_hours           54013
marital_status           54013
major occupation code    54013
race                     54013
sex                      54013
capital_gain             54013
capital_loss             54013
country                  54013
income                   54013
dtype: int64

In [310]:
d.drop_duplicates(inplace=True)

In [311]:
t1.drop_duplicates(inplace=True)

In [312]:
d[d.duplicated()].count()

age                      0
workclass                0
education                0
wage_per_hours           0
marital_status           0
major occupation code    0
race                     0
sex                      0
capital_gain             0
capital_loss             0
country                  0
income                   0
dtype: int64

In [313]:
df = pd.concat([d, t1], axis=0)

In [314]:
df[df.duplicated()].count()

age                      15752
workclass                15752
education                15752
wage_per_hours           15752
marital_status           15752
major occupation code    15752
race                     15752
sex                      15752
capital_gain             15752
capital_loss             15752
country                  15752
income                   15752
dtype: int64

In [315]:
df[df.duplicated()].count()

age                      15752
workclass                15752
education                15752
wage_per_hours           15752
marital_status           15752
major occupation code    15752
race                     15752
sex                      15752
capital_gain             15752
capital_loss             15752
country                  15752
income                   15752
dtype: int64

In [316]:


np.unique(df.country)

array([' ?', ' Cambodia', ' Canada', ' China', ' Columbia', ' Cuba',
       ' Dominican-Republic', ' Ecuador', ' El-Salvador', ' England',
       ' France', ' Germany', ' Greece', ' Guatemala', ' Haiti',
       ' Holand-Netherlands', ' Honduras', ' Hong Kong', ' Hungary',
       ' India', ' Iran', ' Ireland', ' Italy', ' Jamaica', ' Japan',
       ' Laos', ' Mexico', ' Nicaragua', ' Outlying-U S (Guam USVI etc)',
       ' Panama', ' Peru', ' Philippines', ' Poland', ' Portugal',
       ' Puerto-Rico', ' Scotland', ' South Korea', ' Taiwan',
       ' Thailand', ' Trinadad&Tobago', ' United-States', ' Vietnam',
       ' Yugoslavia'], dtype=object)

In [317]:
df.drop_duplicates(inplace=True)

In [318]:
df.replace(' ?', np.nan, inplace=True)

In [319]:
df = pd.concat([df, pd.get_dummies(df['sex'],prefix='sex',prefix_sep=':')], axis=1)
df.drop('sex',axis=1,inplace=True)

In [320]:
df.head()

,age,workclass,education,wage_per_hours,marital_status,major occupation code,race,capital_gain,capital_loss,country,income,sex: Female,sex: Male
0,73,Not in universe,High school graduate,0,Widowed,Not in universe,White,0,0,United-States,- 50000.,1,0
1,58,Self-employed-not incorporated,Some college but no degree,0,Divorced,Precision production craft & repair,White,0,0,United-States,- 50000.,0,1
2,18,Not in universe,10th grade,0,Never married,Not in universe,Asian or Pacific Islander,0,0,Vietnam,- 50000.,1,0
3,9,Not in universe,Children,0,Never married,Not in universe,White,0,0,United-States,- 50000.,1,0
4,10,Not in universe,Children,0,Never married,Not in universe,White,0,0,United-States,- 50000.,1,0

In [321]:
df = pd.concat([df, pd.get_dummies(df['workclass'],prefix='workclass',prefix_sep=':')], axis=1)
df.drop('workclass',axis=1,inplace=True)

In [322]:
df.head()

,age,education,wage_per_hours,marital_status,major occupation code,race,capital_gain,capital_loss,country,income,...,sex: Male,workclass: Federal government,workclass: Local government,workclass: Never worked,workclass: Not in universe,workclass: Private,workclass: Self-employed-incorporated,workclass: Self-employed-not incorporated,workclass: State government,workclass: Without pay
0,73,High school graduate,0,Widowed,Not in universe,White,0,0,United-States,- 50000.,...,0,0,0,0,1,0,0,0,0,0
1,58,Some college but no degree,0,Divorced,Precision production craft & repair,White,0,0,United-States,- 50000.,...,1,0,0,0,0,0,0,1,0,0
2,18,10th grade,0,Never married,Not in universe,Asian or Pacific Islander,0,0,Vietnam,- 50000.,...,0,0,0,0,1,0,0,0,0,0
3,9,Children,0,Never married,Not in universe,White,0,0,United-States,- 50000.,...,0,0,0,0,1,0,0,0,0,0
4,10,Children,0,Never married,Not in universe,White,0,0,United-States,- 50000.,...,0,0,0,0,1,0,0,0,0,0

In [323]:
df = pd.concat([df, pd.get_dummies(df['education'],prefix='education',prefix_sep=':')], axis=1)
df.drop('education',axis=1,inplace=True)

In [324]:
df = pd.concat([df, pd.get_dummies(df['marital_status'],prefix='marital_status',prefix_sep=':')], axis=1)
df.drop('marital_status',axis=1,inplace=True)

In [325]:
df = pd.concat([df, pd.get_dummies(df['major occupation code'],prefix='major occupation code',prefix_sep=':')], axis=1)
df.drop('major occupation code',axis=1,inplace=True)

In [326]:
df = pd.concat([df, pd.get_dummies(df['race'],prefix='race',prefix_sep=':')], axis=1)
df.drop('race',axis=1,inplace=True)

In [327]:
copydf=df

In [328]:









df = pd.concat([df, pd.get_dummies(df['country'],prefix='country',prefix_sep=':')], axis=1)
df.drop('country',axis=1,inplace=True)



df.head()

,age,wage_per_hours,capital_gain,capital_loss,income,sex: Female,sex: Male,workclass: Federal government,workclass: Local government,workclass: Never worked,...,country: Portugal,country: Puerto-Rico,country: Scotland,country: South Korea,country: Taiwan,country: Thailand,country: Trinadad&Tobago,country: United-States,country: Vietnam,country: Yugoslavia
0,73,0,0,0,- 50000.,1,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
1,58,0,0,0,- 50000.,0,1,0,0,0,...,0,0,0,0,0,0,0,1,0,0
2,18,0,0,0,- 50000.,1,0,0,0,0,...,0,0,0,0,0,0,0,0,1,0
3,9,0,0,0,- 50000.,1,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
4,10,0,0,0,- 50000.,1,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [329]:
np.unique(df['income'])

array([' - 50000.', ' 50000+.'], dtype=object)

In [330]:
inc =  df['income'].apply(lambda x : 0 if x==' - 50000.' else 1)

In [331]:
x=df.drop('income',axis=1)

In [337]:
y=inc

In [338]:
x.shape

(109232, 101)

In [339]:
np.unique(y)

array([0, 1])

In [340]:
from keras.utils import np_utils
from keras.models import Sequential
from keras.optimizers import SGD
from keras.layers import Dense
from keras.losses import categorical_crossentropy
from keras.metrics import categorical_accuracy, mean_absolute_error, mse
from keras.optimizers import Adam
from sklearn.preprocessing import StandardScaler

In [341]:
model = Sequential()
model.add(Dense(12, input_dim=101, activation='relu'))
model.add(Dense(101, activation='relu'))
model.add(Dense(1, activation='sigmoid'))
model.compile(loss='binary_crossentropy', optimizer='adam', metrics=['accuracy'])

In [342]:
model.fit(x, y, epochs=24, batch_size=10)

Epoch 1/10
109232/109232 [==============================] - 18s 166us/step - loss: 0.4932 - accuracy: 0.8758
Epoch 2/10
109232/109232 [==============================] - 18s 165us/step - loss: 0.2865 - accuracy: 0.8789
Epoch 3/10
109232/109232 [==============================] - 18s 160us/step - loss: 0.2826 - accuracy: 0.8800
Epoch 4/10
109232/109232 [==============================] - 18s 163us/step - loss: 0.2856 - accuracy: 0.8821
Epoch 5/10
109232/109232 [==============================] - 18s 169us/step - loss: 0.2885 - accuracy: 0.8799
Epoch 6/10
109232/109232 [==============================] - 18s 162us/step - loss: 0.2835 - accuracy: 0.8815
Epoch 7/10
109232/109232 [==============================] - 18s 165us/step - loss: 0.2883 - accuracy: 0.8840
Epoch 8/10
109232/109232 [==============================] - 18s 167us/step - loss: 0.2790 - accuracy: 0.8844
Epoch 9/10
109232/109232 [==============================] - 17s 151us/step - loss: 0.2812 - accuracy: 0.8819
Epoch 10/10
109232/109232 [==============================] - 18s 166us/step - loss: 0.2756 - accuracy: 0.8907

In [279]:
lu=x.columns

In [ ]:
from sklearn.cluster import KMeans

In [ ]:
model = KMeans()

In [ ]:
x=x.astype("float")

x.isin([-5000.]).any()

In [274]:
k=np.unique(x)

1689

In [277]:



model.fit(x)

KMeans(algorithm='auto', copy_x=True, init='k-means++', max_iter=300,
       n_clusters=8, n_init=10, n_jobs=None, precompute_distances='auto',
       random_state=None, tol=0.0001, verbose=0)

In [345]:
df=df.drop('income',axis=1)

In [ ]:
import matplotlib.pyplot as plt
Nc = range(1, 20)
kmeans = [KMeans(n_clusters=i) for i in Nc]
score = [kmeans[i].fit(df).score(df) for i in range(len(kmeans))]
plt.plot(Nc,score)
plt.xlabel('Number of Clusters')
plt.ylabel('Score')
plt.title('Elbow Curve')
plt.show()